# Loading Data with Pandas

In [2]:
import pandas

In [6]:
csv_path='C:/Users/500060783/Desktop/test1.csv' #Initializing path

In [7]:
df=pandas.read_csv(csv_path) # To read the csv file and store the data in df variable

In [8]:
df.head() # Shows the first five rows of the file

      Name   Age  Roll No.
0      NaN   NaN       NaN
1  Saurabh  20.0     141.0
2   Piyush  19.0     135.0
3   Aditya  17.0      15.0
4  Nandani  14.0     100.0

## Dataframes

In [9]:
import pandas as pd

In [14]:
xlxs_path='C:/Users/500060783/Desktop/ECELL/Budget/SHECON_Payment_list.xlsx' # Initializing the path

In [15]:
df=pd.read_excel(xlxs_path) # To read the excel file and store the data in df variable

In [16]:
df.head() # To display the first five rows

,S.No.,Holder Name,SAPID,Bank Name,IFSC code,Account No.,Phone No.,Amount (Rs.)
0,1.0,PIYUSH PRAJAPATI,500069787,Bank of Baroda,BARB0SHACOL,5.179010e+13,9.968996e+09,3000
1,2.0,LOVE SHARMA,500076077,Corporation Bank,CORP0001317,5.201012e+14,6.376386e+09,2000
2,3.0,PURVESH SANDEEP KOTIAN,500066977,State Bank of India,SBIN0005087,3.563470e+10,9.870318e+09,3000
3,4.0,MAYANK MALOO,500075920,Syndicate Bank,SYNB0007391,7.391201e+13,9.101892e+09,2000
4,5.0,MANUJ,500055370,Andhra Bank,ANDB0002250,2.250101e+14,8.954477e+09,2000

### Dataframe is like a Dictionary

In [17]:
songs={'Album':['Thriller','Back in Black'],'Released':[1982,1980]}

In [18]:
songs_frame=pd.DataFrame(songs)

In [19]:
songs_frame

           Album  Released
0       Thriller      1982
1  Back in Black      1980

Keys correspond to header and values to the values in table

In [20]:
x=df[['SAPID']]

In [21]:
x

                     SAPID
0                500069787
1                500076077
2                500066977
3                500075920
4                500055370
5                500060783
6                500068520
7                500060865
8                500076693
9                      NaN
10                     NaN
11                     NaN
12                     NaN
13                     NaN
14  SHECON PAYMENT DETAILS
15                     NaN

In [22]:
y=df[['SAPID','IFSC code','Phone No.']]  # For multiple columns

In [23]:
y

                     SAPID    IFSC code     Phone No.
0                500069787  BARB0SHACOL  9.968996e+09
1                500076077  CORP0001317  6.376386e+09
2                500066977  SBIN0005087  9.870318e+09
3                500075920  SYNB0007391  9.101892e+09
4                500055370  ANDB0002250  8.954477e+09
5                500060783  SBIN0005556  7.088118e+09
6                500068520  HDFC0000854  7.455066e+09
7                500060865  BKID0009110  7.587504e+09
8                500076693  PUNB0205100  9.312896e+09
9                      NaN          NaN           NaN
10                     NaN          NaN           NaN
11                     NaN          NaN           NaN
12                     NaN          NaN           NaN
13                     NaN          NaN           NaN
14  SHECON PAYMENT DETAILS          NaN           NaN
15                     NaN          NaN           NaN